{"cells":[{"cell_type":"code","source":["pip install gremlinpython==3.4.13"],"metadata":{"application/vnd.databricks.v1+cell":{"title":"","showTitle":false,"inputWidgets":{},"nuid":"7f86ebb3-1b31-4f22-bef2-3c2a2a021b8d"}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Python interpreter will be restarted.\nCollecting gremlinpython==3.4.13\n  Using cached gremlinpython-3.4.13-py2.py3-none-any.whl (63 kB)\nCollecting aenum&lt;3.0.0,&gt;=1.4.5\n  Using cached aenum-2.2.6-py3-none-any.whl (43 kB)\nCollecting isodate&lt;1.0.0,&gt;=0.6.0\n  Using cached isodate-0.6.1-py2.py3-none-any.whl (41 kB)\nCollecting tornado&lt;6.0,&gt;=4.4.1\n  Using cached tornado-5.1.1-cp38-cp38-linux_x86_64.whl\nRequirement already satisfied: six&lt;2.0.0,&gt;=1.10.0 in /databricks/python3/lib/python3.8/site-packages (from gremlinpython==3.4.13) (1.15.0)\nInstalling collected packages: tornado, isodate, aenum, gremlinpython\n  Attempting uninstall: tornado\n    Found existing installation: tornado 6.1\n    Not uninstalling tornado at /databricks/python3/lib/python3.8/site-packages, outside environment /local_disk0/.ephemeral_nfs/envs/pythonEnv-4744e176-4544-44e5-bca6-c15df270b02f\n    Can&#39;t uninstall &#39;tornado&#39;. No files were found to uninstall.\nERROR: pip&#39;s dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.\nnotebook 6.3.0 requires tornado&gt;=6.1, but you have tornado 5.1.1 which is incompatible.\nSuccessfully installed aenum-2.2.6 gremlinpython-3.4.13 isodate-0.6.1 tornado-5.1.1\nWARNING: You are using pip version 21.0.1; however, version 22.1.2 is available.\nYou should consider upgrading via the &#39;/local_disk0/.ephemeral_nfs/envs/pythonEnv-4744e176-4544-44e5-bca6-c15df270b02f/bin/python -m pip install --upgrade pip&#39; command.\nPython interpreter will be restarted.\n</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Python interpreter will be restarted.\nCollecting gremlinpython==3.4.13\n  Using cached gremlinpython-3.4.13-py2.py3-none-any.whl (63 kB)\nCollecting aenum&lt;3.0.0,&gt;=1.4.5\n  Using cached aenum-2.2.6-py3-none-any.whl (43 kB)\nCollecting isodate&lt;1.0.0,&gt;=0.6.0\n  Using cached isodate-0.6.1-py2.py3-none-any.whl (41 kB)\nCollecting tornado&lt;6.0,&gt;=4.4.1\n  Using cached tornado-5.1.1-cp38-cp38-linux_x86_64.whl\nRequirement already satisfied: six&lt;2.0.0,&gt;=1.10.0 in /databricks/python3/lib/python3.8/site-packages (from gremlinpython==3.4.13) (1.15.0)\nInstalling collected packages: tornado, isodate, aenum, gremlinpython\n  Attempting uninstall: tornado\n    Found existing installation: tornado 6.1\n    Not uninstalling tornado at /databricks/python3/lib/python3.8/site-packages, outside environment /local_disk0/.ephemeral_nfs/envs/pythonEnv-4744e176-4544-44e5-bca6-c15df270b02f\n    Can&#39;t uninstall &#39;tornado&#39;. No files were found to uninstall.\nERROR: pip&#39;s dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.\nnotebook 6.3.0 requires tornado&gt;=6.1, but you have tornado 5.1.1 which is incompatible.\nSuccessfully installed aenum-2.2.6 gremlinpython-3.4.13 isodate-0.6.1 tornado-5.1.1\nWARNING: You are using pip version 21.0.1; however, version 22.1.2 is available.\nYou should consider upgrading via the &#39;/local_disk0/.ephemeral_nfs/envs/pythonEnv-4744e176-4544-44e5-bca6-c15df270b02f/bin/python -m pip install --upgrade pip&#39; command.\nPython interpreter will be restarted.\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["from gremlin_python.driver import client, serializer, protocol\nfrom gremlin_python.driver.protocol import GremlinServerError\nimport sys\nimport traceback\nimport asyncio\n\nif sys.platform == 'win32':\n    asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n\n_gremlin_cleanup_graph = \"g.V().drop()\"\n\n_gremlin_insert_vertices = [\n    \"g.addV('position').property('id', '800032435').property('firstName', 'STEFA').property('positionTitle', 'CEO').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800053032').property('firstName', 'SCOTT').property('positionTitle', 'CIO').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800034583').property('firstName', 'CECIL').property('positionTitle', 'VP').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800041335').property('firstName', 'KARLA').property('positionTitle', 'Director').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800041323').property('firstName', 'JAMES').property('positionTitle', 'Senior Manager').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800041336').property('firstName', 'MICHAEL').property('positionTitle', 'Manager').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800032620').property('firstName', 'CHAIANE').property('positionTitle', 'Sr Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800033479').property('firstName', 'ERIC BAUTISTA').property('positionTitle', 'Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800057750').property('firstName', 'YOSHIYASU').property('positionTitle', 'CIO').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800054157').property('firstName', 'DEQIANG').property('positionTitle', 'VP').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800041447').property('firstName', 'CYNTHIA').property('positionTitle', 'Director').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800053769').property('firstName', 'MAURICIO').property('positionTitle', 'VP').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800048046').property('firstName', 'JUNIL-KAY PETA-GAYE').property('positionTitle', 'Director').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800042500').property('firstName', 'MARVIN A').property('positionTitle', 'Sr Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800014680').property('firstName', 'JOHANNES').property('positionTitle', 'Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800059308').property('firstName', 'MARCIO').property('positionTitle', 'Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800054608').property('firstName', 'CATHERINE L').property('positionTitle', 'Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800057297').property('firstName', 'RICARDO').property('positionTitle', 'Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800035989').property('firstName', 'JEANE ASIBAL').property('positionTitle', 'Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800036078').property('firstName', 'LISA').property('positionTitle', 'Developer').property('pk', 'pk')\"\n\n]\n\n_gremlin_insert_edges = [\n    \"g.V('800032435').addE('REPORTS_TO_CURRENT_POSITION').to(g.V(''))\",\n    \"g.V('800053032').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800032435'))\",\n    \"g.V('800034583').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800053032'))\",\n    \"g.V('800041335').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800053032'))\",\n    \"g.V('800041323').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800034583'))\",\n    \"g.V('800041336').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800041335'))\",\n    \"g.V('800032620').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800041323'))\",\n    \"g.V('800033479').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800041336'))\",\n    \"g.V('800057750').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800032620'))\",\n    \"g.V('800054157').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800033479'))\",\n    \"g.V('800041447').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800032435'))\",\n    \"g.V('800053769').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800041447'))\",\n    \"g.V('800048046').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800053769'))\",\n    \"g.V('800042500').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800048046'))\",\n    \"g.V('800014680').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800042500'))\",\n    \"g.V('800059308').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800048046'))\",\n    \"g.V('800054608').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800042500'))\",\n    \"g.V('800057297').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800053769'))\",\n    \"g.V('800035989').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800048046'))\",\n    \"g.V('800036078').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800042500'))\"\n\n]\n\n\n\n_gremlin_count_vertices = \"g.V().count()\"\n\n\ndef print_status_attributes(result):\n    print(\"\\tResponse status_attributes:\\n\\t{0}\".format(result.status_attributes))\n\ndef cleanup_graph(client):\n    print(\"\\n> {0}\".format(\n        _gremlin_cleanup_graph))\n    callback = client.submitAsync(_gremlin_cleanup_graph)\n    if callback.result() is not None:\n        callback.result().all().result() \n    print(\"\\n\")\n    print_status_attributes(callback.result())\n    print(\"\\n\")\n\n\ndef insert_vertices(client):\n    for query in _gremlin_insert_vertices:\n        print(\"\\n> {0}\\n\".format(query))\n        callback = client.submitAsync(query)\n        if callback.result() is not None:\n            print(\"\\tInserted this vertex:\\n\\t{0}\".format(\n                callback.result().all().result()))\n        else:\n            print(\"Something went wrong with this query: {0}\".format(query))\n        print(\"\\n\")\n        print_status_attributes(callback.result())\n        print(\"\\n\")\n\n    print(\"\\n\")\n    \ndef insert_edges(client):\n    for query in _gremlin_insert_edges:\n        print(\"\\n> {0}\\n\".format(query))\n        callback = client.submitAsync(query)\n        if callback.result() is not None:\n            print(\"\\tInserted this edge:\\n\\t{0}\\n\".format(\n                callback.result().all().result()))\n        else:\n            print(\"Something went wrong with this query:\\n\\t{0}\".format(query))\n        print_status_attributes(callback.result())\n        print(\"\\n\")\n\n\n\n\n\n\n        \ntry:\n    client = client.Client('wss://positiongraph.gremlin.cosmos.azure.com:443/', 'g',\n                           username=\"/dbs/Position/colls/positions\",\n                           password=\"YHezU48GVZBBYP09VUKzOpsgI3AsMLWMzpfIM7glTOEcV7muhauFXS8oQC1ADIRxfP5YF0r75tOnrswT6UqNiQ==\",\n                           message_serializer=serializer.GraphSONSerializersV2d0()\n                           )\n\n    print(\"Welcome to Azure Cosmos DB + Gremlin on Python!\")\n\n    # Drop the entire Graph\n    cleanup_graph(client)\n\n    # Insert all vertices\n    insert_vertices(client)\n    \n\n    # Create edges between vertices\n    insert_edges(client)\n    \n\n    # # Update a vertex\n    # update_vertices(client)\n    \n    # # Count all vertices\n    \n    # count_vertices(client)\n    #\n    # # Execute traversals and get results\n    # execute_traversals(client)\n    \n    # # Drop a few vertices and edges\n \n    #execute_drop_operations(client)\n    \n    # # Count all vertices again\n \n    # count_vertices(client)\n\nexcept GremlinServerError as e:\n    print('Code: {0}, Attributes: {1}'.format(e.status_code, e.status_attributes))\n\n    cosmos_status_code = e.status_attributes[\"x-ms-status-code\"]\n    if cosmos_status_code == 409:\n        print('Conflict error!')\n    elif cosmos_status_code == 412:\n        print('Precondition error!')\n    elif cosmos_status_code == 429:\n        print('Throttling error!');\n    elif cosmos_status_code == 1009:\n        print('Request timeout error!')\n    else:\n        print(\"Default error handling\")\n\n    traceback.print_exc(file=sys.stdout) \n    sys.exit(1)\n\n"],"metadata":{"application/vnd.databricks.v1+cell":{"title":"","showTitle":false,"inputWidgets":{},"nuid":"5d03a8fe-38ff-4a5d-b102-a7540ed7981d"}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Welcome to Azure Cosmos DB + Gremlin on Python!\n\n&gt; g.V().drop()\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;07cd4519-58de-44e8-8c1f-3b11a2bddd0a&#39;, &#39;x-ms-request-charge&#39;: 1963.3199999999945, &#39;x-ms-total-request-charge&#39;: 1963.3199999999945, &#39;x-ms-server-time-ms&#39;: 899.203, &#39;x-ms-total-server-time-ms&#39;: 899.203}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800032435&#39;).property(&#39;firstName&#39;, &#39;STEFA&#39;).property(&#39;positionTitle&#39;, &#39;CEO&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800032435&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;cfd6b82b-844b-4e55-909b-d3e0ddb535d2&#39;, &#39;value&#39;: &#39;STEFA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;feadef49-437f-4f58-b668-c1866f1eedde&#39;, &#39;value&#39;: &#39;CEO&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800032435|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;17d096ba-4fab-45f9-8453-774727cd5367&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 32.807, &#39;x-ms-total-server-time-ms&#39;: 32.807}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800053032&#39;).property(&#39;firstName&#39;, &#39;SCOTT&#39;).property(&#39;positionTitle&#39;, &#39;CIO&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800053032&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;813eb2b2-fcd3-4cbf-8168-1b7a6b371dee&#39;, &#39;value&#39;: &#39;SCOTT&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;ff84455a-584b-4dc0-a9be-79b504c088d2&#39;, &#39;value&#39;: &#39;CIO&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800053032|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;a907f4ec-5d72-4ae8-a748-55823c8daef1&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.8995, &#39;x-ms-total-server-time-ms&#39;: 6.8995}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800034583&#39;).property(&#39;firstName&#39;, &#39;CECIL&#39;).property(&#39;positionTitle&#39;, &#39;VP&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800034583&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;1fe76566-2d76-4063-aa69-586208d7c012&#39;, &#39;value&#39;: &#39;CECIL&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;04cdc37c-1dcb-45b1-8975-90257a833668&#39;, &#39;value&#39;: &#39;VP&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800034583|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;eb256eaa-d1c4-4b81-89cb-ea4dfa9d2220&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 35.8763, &#39;x-ms-total-server-time-ms&#39;: 35.8763}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800041335&#39;).property(&#39;firstName&#39;, &#39;KARLA&#39;).property(&#39;positionTitle&#39;, &#39;Director&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800041335&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;d8ddaa57-4a87-4ff9-b77a-e4a5cbbc28cd&#39;, &#39;value&#39;: &#39;KARLA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;33bfedcc-e05e-4202-ad0f-b3832d3c8e7f&#39;, &#39;value&#39;: &#39;Director&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800041335|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;00637bcb-4333-4659-93b4-ae29c1d5be37&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.1339, &#39;x-ms-total-server-time-ms&#39;: 6.1339}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800041323&#39;).property(&#39;firstName&#39;, &#39;JAMES&#39;).property(&#39;positionTitle&#39;, &#39;Senior Manager&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800041323&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;3792d4df-f4a7-4921-9ffa-a17c455eecff&#39;, &#39;value&#39;: &#39;JAMES&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;fb5842cc-aaff-443f-a839-ae8e17294e22&#39;, &#39;value&#39;: &#39;Senior Manager&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800041323|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;72828295-dd32-44e9-bed0-f39b2ede066e&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 7.3682, &#39;x-ms-total-server-time-ms&#39;: 7.3682}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800041336&#39;).property(&#39;firstName&#39;, &#39;MICHAEL&#39;).property(&#39;positionTitle&#39;, &#39;Manager&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800041336&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;7602538d-d47f-49a4-a883-2b17a1398867&#39;, &#39;value&#39;: &#39;MICHAEL&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;fc95f698-0048-40b2-b142-511ec5e05ffa&#39;, &#39;value&#39;: &#39;Manager&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800041336|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;27d2583b-5c21-4ed8-abb2-845c65fee5ef&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.0532, &#39;x-ms-total-server-time-ms&#39;: 6.0532}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800032620&#39;).property(&#39;firstName&#39;, &#39;CHAIANE&#39;).property(&#39;positionTitle&#39;, &#39;Sr Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800032620&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;2591f03d-323a-4407-a63e-5dfbd12e59b1&#39;, &#39;value&#39;: &#39;CHAIANE&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;d67a2b97-d9ee-49bd-bbf0-217593a2ad04&#39;, &#39;value&#39;: &#39;Sr Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800032620|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;eed8e150-04f1-444b-accb-b12cf5ca536c&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.4084, &#39;x-ms-total-server-time-ms&#39;: 6.4084}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800033479&#39;).property(&#39;firstName&#39;, &#39;ERIC BAUTISTA&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800033479&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;b42f08eb-a076-4892-b7de-0e6c6c166a04&#39;, &#39;value&#39;: &#39;ERIC BAUTISTA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;19b03d1f-ea39-46d1-9d44-c5b3a73d5325&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800033479|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;1727b75f-0d2b-4189-9c10-42b4c3185e9b&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 7.0914, &#39;x-ms-total-server-time-ms&#39;: 7.0914}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800057750&#39;).property(&#39;firstName&#39;, &#39;YOSHIYASU&#39;).property(&#39;positionTitle&#39;, &#39;CIO&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800057750&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;97f982a3-3d22-4434-a4f6-4ad8306498c7&#39;, &#39;value&#39;: &#39;YOSHIYASU&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;47134d9d-403f-474c-88dc-2ce04fc14805&#39;, &#39;value&#39;: &#39;CIO&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800057750|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;bddbe13d-7949-4e85-881c-b6f220c532e1&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.7485, &#39;x-ms-total-server-time-ms&#39;: 6.7485}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800054157&#39;).property(&#39;firstName&#39;, &#39;DEQIANG&#39;).property(&#39;positionTitle&#39;, &#39;VP&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800054157&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;912f69e7-7ddf-4ed2-979d-ce917c2173e5&#39;, &#39;value&#39;: &#39;DEQIANG&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;aeaa5e5e-fbe4-4236-bea0-d6893ea68717&#39;, &#39;value&#39;: &#39;VP&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800054157|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;2979012e-be87-4ebf-a860-c7ad99fb7baf&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 5.7519, &#39;x-ms-total-server-time-ms&#39;: 5.7519}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800041447&#39;).property(&#39;firstName&#39;, &#39;CYNTHIA&#39;).property(&#39;positionTitle&#39;, &#39;Director&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800041447&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;7db1d291-bef4-4044-a9d0-ee98b3249c4f&#39;, &#39;value&#39;: &#39;CYNTHIA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;052730d2-1f44-41cb-ae05-b89f72e2ae24&#39;, &#39;value&#39;: &#39;Director&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800041447|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;c99e9e3c-689d-4948-8d78-26cad46363d4&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.3724, &#39;x-ms-total-server-time-ms&#39;: 6.3724}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800053769&#39;).property(&#39;firstName&#39;, &#39;MAURICIO&#39;).property(&#39;positionTitle&#39;, &#39;VP&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800053769&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;b8713899-d1a2-44d1-8d68-060649eaa074&#39;, &#39;value&#39;: &#39;MAURICIO&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;f07829d1-d4a1-4379-9e3c-cb27b038ec1f&#39;, &#39;value&#39;: &#39;VP&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800053769|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;618e0c6d-32e4-46bb-8c83-a580865a6186&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.6063, &#39;x-ms-total-server-time-ms&#39;: 6.6063}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800048046&#39;).property(&#39;firstName&#39;, &#39;JUNIL-KAY PETA-GAYE&#39;).property(&#39;positionTitle&#39;, &#39;Director&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800048046&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;5006cfcb-01c9-47dd-ad76-ee0c8de76b99&#39;, &#39;value&#39;: &#39;JUNIL-KAY PETA-GAYE&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;4989d94f-fe3f-4a2c-b8da-736cc8a3cfc8&#39;, &#39;value&#39;: &#39;Director&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800048046|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;cc4c8e34-ca39-47fd-a094-dcd457dd695e&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.8363, &#39;x-ms-total-server-time-ms&#39;: 6.8363}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800042500&#39;).property(&#39;firstName&#39;, &#39;MARVIN A&#39;).property(&#39;positionTitle&#39;, &#39;Sr Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800042500&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;21cf580b-f08d-4951-ade8-5f18658cf996&#39;, &#39;value&#39;: &#39;MARVIN A&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;a249598d-e579-4f79-8e27-911cb76c12bb&#39;, &#39;value&#39;: &#39;Sr Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800042500|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;cb6bd731-dc76-4743-a596-9beab6a8bd9e&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.4917, &#39;x-ms-total-server-time-ms&#39;: 6.4917}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800014680&#39;).property(&#39;firstName&#39;, &#39;JOHANNES&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800014680&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;473892f6-bf28-4717-b481-a3b50b44cfb0&#39;, &#39;value&#39;: &#39;JOHANNES&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;bc29c64e-0cb1-43f9-86ed-cfe039c09e16&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800014680|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;ff24e952-cc11-4f9f-beae-f55b5cb47914&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.3426, &#39;x-ms-total-server-time-ms&#39;: 6.3426}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800059308&#39;).property(&#39;firstName&#39;, &#39;MARCIO&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800059308&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;b4083379-526a-4911-a4a4-56b228119736&#39;, &#39;value&#39;: &#39;MARCIO&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;33fcf88b-016c-4e31-a224-470c2bc21b0c&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800059308|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;3d3ac3a1-c53a-4cb8-a377-7de677dfde69&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.4558, &#39;x-ms-total-server-time-ms&#39;: 6.4558}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800054608&#39;).property(&#39;firstName&#39;, &#39;CATHERINE L&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800054608&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;f49d2a84-ee13-4649-a7f9-7484f506c6b0&#39;, &#39;value&#39;: &#39;CATHERINE L&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;f5fe00cf-02ec-4b25-9f1e-41cd9dda0b12&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800054608|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;8e83d23b-b4f6-42f4-a5f8-89e0d15f5105&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.4325, &#39;x-ms-total-server-time-ms&#39;: 6.4325}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800057297&#39;).property(&#39;firstName&#39;, &#39;RICARDO&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800057297&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;17a460cb-73b6-4dfe-be0e-bea4fac5334c&#39;, &#39;value&#39;: &#39;RICARDO&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;503a12b0-9076-40aa-a4dc-bd681cccc723&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800057297|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;68f2b5bc-1b45-465f-9e76-3fef6e2ed6e7&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.9805, &#39;x-ms-total-server-time-ms&#39;: 6.9805}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800035989&#39;).property(&#39;firstName&#39;, &#39;JEANE ASIBAL&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800035989&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;3ee19554-1afa-4603-ae2f-460ec32529f3&#39;, &#39;value&#39;: &#39;JEANE ASIBAL&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;8719a2f9-fe98-4155-aea8-62c99617a7cc&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800035989|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;43df37d9-3b65-4289-84a2-271433dee361&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 7.4116, &#39;x-ms-total-server-time-ms&#39;: 7.4116}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800036078&#39;).property(&#39;firstName&#39;, &#39;LISA&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800036078&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;89770a4d-3cca-4ac2-b7c8-adf50de33b24&#39;, &#39;value&#39;: &#39;LISA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;69813057-64db-4d28-a670-929bace35098&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800036078|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;bd52857c-7eed-4c6c-855b-72007dfb9c05&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 7.4355, &#39;x-ms-total-server-time-ms&#39;: 7.4355}\n\n\n\n\n\n&gt; g.V(&#39;800032435&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;&#39;))\n\n\tInserted this edge:\n\t[]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;1fad39e8-82e3-40f0-ae6d-693a24350ad4&#39;, &#39;x-ms-request-charge&#39;: 5.8100000000000005, &#39;x-ms-total-request-charge&#39;: 5.8100000000000005, &#39;x-ms-server-time-ms&#39;: 62.03, &#39;x-ms-total-server-time-ms&#39;: 62.03}\n\n\n\n&gt; g.V(&#39;800053032&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800032435&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;4077e89e-e5a9-4f1a-9aa3-d201b49e8367&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800032435&#39;, &#39;outV&#39;: &#39;800053032&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;47997520-f0de-43aa-a2bf-961f12101158&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 12.0284, &#39;x-ms-total-server-time-ms&#39;: 12.0284}\n\n\n\n&gt; g.V(&#39;800034583&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800053032&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;431216ef-a0ac-4d5f-b597-0f5c8b594731&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800053032&#39;, &#39;outV&#39;: &#39;800034583&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;9716de99-d1bf-4b63-9247-be10f45d2c9e&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 31.4144, &#39;x-ms-total-server-time-ms&#39;: 31.4144}\n\n\n\n&gt; g.V(&#39;800041335&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800053032&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;32584649-e624-4ea0-be52-38f4d481f8f3&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800053032&#39;, &#39;outV&#39;: &#39;800041335&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;7146f270-b13f-436b-bd99-3b20b6e0d992&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.3737, &#39;x-ms-total-server-time-ms&#39;: 13.3737}\n\n\n\n&gt; g.V(&#39;800041323&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800034583&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;b3228c0f-3d38-4d04-ac37-85f8be084eda&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800034583&#39;, &#39;outV&#39;: &#39;800041323&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;e7ddf571-5359-4bbc-ba73-6cf6a5e9b895&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.6347, &#39;x-ms-total-server-time-ms&#39;: 13.6347}\n\n\n\n&gt; g.V(&#39;800041336&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800041335&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;3ba187ec-5ac7-4807-842b-1c6f83401f76&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800041335&#39;, &#39;outV&#39;: &#39;800041336&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;f921f2c4-2652-49ac-86ce-99537a165b22&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 12.7773, &#39;x-ms-total-server-time-ms&#39;: 12.7773}\n\n\n\n&gt; g.V(&#39;800032620&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800041323&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;bc7e26b3-0ad2-41ee-a854-b7dd0408caaa&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800041323&#39;, &#39;outV&#39;: &#39;800032620&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;625358f8-d72e-4f2a-9e3c-efe4744fbb6e&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 41.5231, &#39;x-ms-total-server-time-ms&#39;: 41.5231}\n\n\n\n&gt; g.V(&#39;800033479&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800041336&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;35719bb3-4954-47d7-9d6b-e7f6e63a9183&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800041336&#39;, &#39;outV&#39;: &#39;800033479&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;ef76487c-854e-4e47-b47e-c5558cdee088&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.4388, &#39;x-ms-total-server-time-ms&#39;: 13.4388}\n\n\n\n&gt; g.V(&#39;800057750&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800032620&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;38c37525-13ee-4576-ac64-ac692cd61e8f&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800032620&#39;, &#39;outV&#39;: &#39;800057750&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;ee72d95c-5fb2-42ae-ae0d-d2fde51136e2&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 14.8713, &#39;x-ms-total-server-time-ms&#39;: 14.8713}\n\n\n\n&gt; g.V(&#39;800054157&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800033479&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;30be59fc-f59c-4f1e-88e7-906fcf558e84&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800033479&#39;, &#39;outV&#39;: &#39;800054157&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;9d44dcdf-372d-4063-a117-a828b7d94881&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 14.1714, &#39;x-ms-total-server-time-ms&#39;: 14.1714}\n\n\n\n&gt; g.V(&#39;800041447&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800032435&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;880a558d-3044-49ae-9cd8-55bba6bd2d5e&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800032435&#39;, &#39;outV&#39;: &#39;800041447&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;965197be-1ae9-4300-89db-6d1b7cec31d2&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 28.7001, &#39;x-ms-total-server-time-ms&#39;: 28.7001}\n\n\n\n&gt; g.V(&#39;800053769&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800041447&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;c04b7f26-7c20-4650-bbec-9d42311e9fcf&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800041447&#39;, &#39;outV&#39;: &#39;800053769&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;2a838b58-88ae-4df3-8ade-8221f0eb2dc6&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 12.9355, &#39;x-ms-total-server-time-ms&#39;: 12.9355}\n\n\n\n&gt; g.V(&#39;800048046&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800053769&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;59e52a28-9d7c-4c1a-b182-7b1bc2e0f54a&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800053769&#39;, &#39;outV&#39;: &#39;800048046&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;098bfc03-2277-4446-b426-62ae54f3c75d&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.0106, &#39;x-ms-total-server-time-ms&#39;: 13.0106}\n\n\n\n&gt; g.V(&#39;800042500&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800048046&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;984529d5-a5fd-4423-8755-e2e172ee4b50&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800048046&#39;, &#39;outV&#39;: &#39;800042500&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;8717a9f7-5da3-45be-92a8-ec06c5e7aafd&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.0807, &#39;x-ms-total-server-time-ms&#39;: 13.0807}\n\n\n\n&gt; g.V(&#39;800014680&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800042500&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;eb6bb3c5-b7c9-42ff-839b-b21567fe83da&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800042500&#39;, &#39;outV&#39;: &#39;800014680&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;bb2390e0-2fc0-4195-b773-40827223bfb2&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.1797, &#39;x-ms-total-server-time-ms&#39;: 13.1797}\n\n\n\n&gt; g.V(&#39;800059308&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800048046&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;1b6f4197-83bf-40fd-a4a3-3fc797148a82&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800048046&#39;, &#39;outV&#39;: &#39;800059308&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;af3d593a-8ed0-44ee-bbd5-808b518135ea&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.0728, &#39;x-ms-total-server-time-ms&#39;: 13.0728}\n\n\n\n&gt; g.V(&#39;800054608&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800042500&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;59c3ccf5-1001-42a5-a6f8-2369fb9d8584&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800042500&#39;, &#39;outV&#39;: &#39;800054608&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;b004ce89-c285-4b49-8bed-251cc1d7ec39&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.2527, &#39;x-ms-total-server-time-ms&#39;: 13.2527}\n\n\n\n&gt; g.V(&#39;800057297&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800053769&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;f6f91b4a-da1c-46a3-8a0b-cd432b1c1537&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800053769&#39;, &#39;outV&#39;: &#39;800057297&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;6c1d0e9f-d6b8-483f-88d4-4b8752779702&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.8625, &#39;x-ms-total-server-time-ms&#39;: 13.8625}\n\n\n\n&gt; g.V(&#39;800035989&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800048046&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;1e2814d6-2f45-46ca-be72-52636e80d759&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800048046&#39;, &#39;outV&#39;: &#39;800035989&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;27f0f31d-3202-4436-bd1d-3cc6df7ca8f2&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.0097, &#39;x-ms-total-server-time-ms&#39;: 13.0097}\n\n\n\n&gt; g.V(&#39;800036078&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800042500&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;7f72a616-96dd-4426-b196-59f0f09bbbc2&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800042500&#39;, &#39;outV&#39;: &#39;800036078&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;cf684202-abc3-4523-89a8-900e9cded661&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.359, &#39;x-ms-total-server-time-ms&#39;: 13.359}\n\n\n</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Welcome to Azure Cosmos DB + Gremlin on Python!\n\n&gt; g.V().drop()\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;07cd4519-58de-44e8-8c1f-3b11a2bddd0a&#39;, &#39;x-ms-request-charge&#39;: 1963.3199999999945, &#39;x-ms-total-request-charge&#39;: 1963.3199999999945, &#39;x-ms-server-time-ms&#39;: 899.203, &#39;x-ms-total-server-time-ms&#39;: 899.203}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800032435&#39;).property(&#39;firstName&#39;, &#39;STEFA&#39;).property(&#39;positionTitle&#39;, &#39;CEO&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800032435&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;cfd6b82b-844b-4e55-909b-d3e0ddb535d2&#39;, &#39;value&#39;: &#39;STEFA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;feadef49-437f-4f58-b668-c1866f1eedde&#39;, &#39;value&#39;: &#39;CEO&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800032435|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;17d096ba-4fab-45f9-8453-774727cd5367&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 32.807, &#39;x-ms-total-server-time-ms&#39;: 32.807}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800053032&#39;).property(&#39;firstName&#39;, &#39;SCOTT&#39;).property(&#39;positionTitle&#39;, &#39;CIO&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800053032&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;813eb2b2-fcd3-4cbf-8168-1b7a6b371dee&#39;, &#39;value&#39;: &#39;SCOTT&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;ff84455a-584b-4dc0-a9be-79b504c088d2&#39;, &#39;value&#39;: &#39;CIO&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800053032|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;a907f4ec-5d72-4ae8-a748-55823c8daef1&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.8995, &#39;x-ms-total-server-time-ms&#39;: 6.8995}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800034583&#39;).property(&#39;firstName&#39;, &#39;CECIL&#39;).property(&#39;positionTitle&#39;, &#39;VP&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800034583&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;1fe76566-2d76-4063-aa69-586208d7c012&#39;, &#39;value&#39;: &#39;CECIL&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;04cdc37c-1dcb-45b1-8975-90257a833668&#39;, &#39;value&#39;: &#39;VP&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800034583|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;eb256eaa-d1c4-4b81-89cb-ea4dfa9d2220&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 35.8763, &#39;x-ms-total-server-time-ms&#39;: 35.8763}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800041335&#39;).property(&#39;firstName&#39;, &#39;KARLA&#39;).property(&#39;positionTitle&#39;, &#39;Director&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800041335&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;d8ddaa57-4a87-4ff9-b77a-e4a5cbbc28cd&#39;, &#39;value&#39;: &#39;KARLA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;33bfedcc-e05e-4202-ad0f-b3832d3c8e7f&#39;, &#39;value&#39;: &#39;Director&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800041335|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;00637bcb-4333-4659-93b4-ae29c1d5be37&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.1339, &#39;x-ms-total-server-time-ms&#39;: 6.1339}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800041323&#39;).property(&#39;firstName&#39;, &#39;JAMES&#39;).property(&#39;positionTitle&#39;, &#39;Senior Manager&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800041323&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;3792d4df-f4a7-4921-9ffa-a17c455eecff&#39;, &#39;value&#39;: &#39;JAMES&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;fb5842cc-aaff-443f-a839-ae8e17294e22&#39;, &#39;value&#39;: &#39;Senior Manager&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800041323|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;72828295-dd32-44e9-bed0-f39b2ede066e&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 7.3682, &#39;x-ms-total-server-time-ms&#39;: 7.3682}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800041336&#39;).property(&#39;firstName&#39;, &#39;MICHAEL&#39;).property(&#39;positionTitle&#39;, &#39;Manager&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800041336&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;7602538d-d47f-49a4-a883-2b17a1398867&#39;, &#39;value&#39;: &#39;MICHAEL&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;fc95f698-0048-40b2-b142-511ec5e05ffa&#39;, &#39;value&#39;: &#39;Manager&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800041336|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;27d2583b-5c21-4ed8-abb2-845c65fee5ef&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.0532, &#39;x-ms-total-server-time-ms&#39;: 6.0532}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800032620&#39;).property(&#39;firstName&#39;, &#39;CHAIANE&#39;).property(&#39;positionTitle&#39;, &#39;Sr Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800032620&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;2591f03d-323a-4407-a63e-5dfbd12e59b1&#39;, &#39;value&#39;: &#39;CHAIANE&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;d67a2b97-d9ee-49bd-bbf0-217593a2ad04&#39;, &#39;value&#39;: &#39;Sr Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800032620|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;eed8e150-04f1-444b-accb-b12cf5ca536c&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.4084, &#39;x-ms-total-server-time-ms&#39;: 6.4084}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800033479&#39;).property(&#39;firstName&#39;, &#39;ERIC BAUTISTA&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800033479&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;b42f08eb-a076-4892-b7de-0e6c6c166a04&#39;, &#39;value&#39;: &#39;ERIC BAUTISTA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;19b03d1f-ea39-46d1-9d44-c5b3a73d5325&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800033479|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;1727b75f-0d2b-4189-9c10-42b4c3185e9b&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 7.0914, &#39;x-ms-total-server-time-ms&#39;: 7.0914}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800057750&#39;).property(&#39;firstName&#39;, &#39;YOSHIYASU&#39;).property(&#39;positionTitle&#39;, &#39;CIO&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800057750&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;97f982a3-3d22-4434-a4f6-4ad8306498c7&#39;, &#39;value&#39;: &#39;YOSHIYASU&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;47134d9d-403f-474c-88dc-2ce04fc14805&#39;, &#39;value&#39;: &#39;CIO&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800057750|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;bddbe13d-7949-4e85-881c-b6f220c532e1&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.7485, &#39;x-ms-total-server-time-ms&#39;: 6.7485}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800054157&#39;).property(&#39;firstName&#39;, &#39;DEQIANG&#39;).property(&#39;positionTitle&#39;, &#39;VP&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800054157&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;912f69e7-7ddf-4ed2-979d-ce917c2173e5&#39;, &#39;value&#39;: &#39;DEQIANG&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;aeaa5e5e-fbe4-4236-bea0-d6893ea68717&#39;, &#39;value&#39;: &#39;VP&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800054157|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;2979012e-be87-4ebf-a860-c7ad99fb7baf&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 5.7519, &#39;x-ms-total-server-time-ms&#39;: 5.7519}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800041447&#39;).property(&#39;firstName&#39;, &#39;CYNTHIA&#39;).property(&#39;positionTitle&#39;, &#39;Director&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800041447&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;7db1d291-bef4-4044-a9d0-ee98b3249c4f&#39;, &#39;value&#39;: &#39;CYNTHIA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;052730d2-1f44-41cb-ae05-b89f72e2ae24&#39;, &#39;value&#39;: &#39;Director&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800041447|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;c99e9e3c-689d-4948-8d78-26cad46363d4&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.3724, &#39;x-ms-total-server-time-ms&#39;: 6.3724}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800053769&#39;).property(&#39;firstName&#39;, &#39;MAURICIO&#39;).property(&#39;positionTitle&#39;, &#39;VP&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800053769&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;b8713899-d1a2-44d1-8d68-060649eaa074&#39;, &#39;value&#39;: &#39;MAURICIO&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;f07829d1-d4a1-4379-9e3c-cb27b038ec1f&#39;, &#39;value&#39;: &#39;VP&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800053769|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;618e0c6d-32e4-46bb-8c83-a580865a6186&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.6063, &#39;x-ms-total-server-time-ms&#39;: 6.6063}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800048046&#39;).property(&#39;firstName&#39;, &#39;JUNIL-KAY PETA-GAYE&#39;).property(&#39;positionTitle&#39;, &#39;Director&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800048046&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;5006cfcb-01c9-47dd-ad76-ee0c8de76b99&#39;, &#39;value&#39;: &#39;JUNIL-KAY PETA-GAYE&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;4989d94f-fe3f-4a2c-b8da-736cc8a3cfc8&#39;, &#39;value&#39;: &#39;Director&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800048046|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;cc4c8e34-ca39-47fd-a094-dcd457dd695e&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.8363, &#39;x-ms-total-server-time-ms&#39;: 6.8363}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800042500&#39;).property(&#39;firstName&#39;, &#39;MARVIN A&#39;).property(&#39;positionTitle&#39;, &#39;Sr Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800042500&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;21cf580b-f08d-4951-ade8-5f18658cf996&#39;, &#39;value&#39;: &#39;MARVIN A&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;a249598d-e579-4f79-8e27-911cb76c12bb&#39;, &#39;value&#39;: &#39;Sr Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800042500|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;cb6bd731-dc76-4743-a596-9beab6a8bd9e&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.4917, &#39;x-ms-total-server-time-ms&#39;: 6.4917}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800014680&#39;).property(&#39;firstName&#39;, &#39;JOHANNES&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800014680&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;473892f6-bf28-4717-b481-a3b50b44cfb0&#39;, &#39;value&#39;: &#39;JOHANNES&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;bc29c64e-0cb1-43f9-86ed-cfe039c09e16&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800014680|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;ff24e952-cc11-4f9f-beae-f55b5cb47914&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.3426, &#39;x-ms-total-server-time-ms&#39;: 6.3426}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800059308&#39;).property(&#39;firstName&#39;, &#39;MARCIO&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800059308&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;b4083379-526a-4911-a4a4-56b228119736&#39;, &#39;value&#39;: &#39;MARCIO&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;33fcf88b-016c-4e31-a224-470c2bc21b0c&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800059308|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;3d3ac3a1-c53a-4cb8-a377-7de677dfde69&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.4558, &#39;x-ms-total-server-time-ms&#39;: 6.4558}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800054608&#39;).property(&#39;firstName&#39;, &#39;CATHERINE L&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800054608&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;f49d2a84-ee13-4649-a7f9-7484f506c6b0&#39;, &#39;value&#39;: &#39;CATHERINE L&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;f5fe00cf-02ec-4b25-9f1e-41cd9dda0b12&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800054608|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;8e83d23b-b4f6-42f4-a5f8-89e0d15f5105&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.4325, &#39;x-ms-total-server-time-ms&#39;: 6.4325}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800057297&#39;).property(&#39;firstName&#39;, &#39;RICARDO&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800057297&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;17a460cb-73b6-4dfe-be0e-bea4fac5334c&#39;, &#39;value&#39;: &#39;RICARDO&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;503a12b0-9076-40aa-a4dc-bd681cccc723&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800057297|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;68f2b5bc-1b45-465f-9e76-3fef6e2ed6e7&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.9805, &#39;x-ms-total-server-time-ms&#39;: 6.9805}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800035989&#39;).property(&#39;firstName&#39;, &#39;JEANE ASIBAL&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800035989&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;3ee19554-1afa-4603-ae2f-460ec32529f3&#39;, &#39;value&#39;: &#39;JEANE ASIBAL&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;8719a2f9-fe98-4155-aea8-62c99617a7cc&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800035989|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;43df37d9-3b65-4289-84a2-271433dee361&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 7.4116, &#39;x-ms-total-server-time-ms&#39;: 7.4116}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800036078&#39;).property(&#39;firstName&#39;, &#39;LISA&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800036078&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;89770a4d-3cca-4ac2-b7c8-adf50de33b24&#39;, &#39;value&#39;: &#39;LISA&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;69813057-64db-4d28-a670-929bace35098&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800036078|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;bd52857c-7eed-4c6c-855b-72007dfb9c05&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 7.4355, &#39;x-ms-total-server-time-ms&#39;: 7.4355}\n\n\n\n\n\n&gt; g.V(&#39;800032435&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;&#39;))\n\n\tInserted this edge:\n\t[]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;1fad39e8-82e3-40f0-ae6d-693a24350ad4&#39;, &#39;x-ms-request-charge&#39;: 5.8100000000000005, &#39;x-ms-total-request-charge&#39;: 5.8100000000000005, &#39;x-ms-server-time-ms&#39;: 62.03, &#39;x-ms-total-server-time-ms&#39;: 62.03}\n\n\n\n&gt; g.V(&#39;800053032&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800032435&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;4077e89e-e5a9-4f1a-9aa3-d201b49e8367&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800032435&#39;, &#39;outV&#39;: &#39;800053032&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;47997520-f0de-43aa-a2bf-961f12101158&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 12.0284, &#39;x-ms-total-server-time-ms&#39;: 12.0284}\n\n\n\n&gt; g.V(&#39;800034583&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800053032&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;431216ef-a0ac-4d5f-b597-0f5c8b594731&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800053032&#39;, &#39;outV&#39;: &#39;800034583&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;9716de99-d1bf-4b63-9247-be10f45d2c9e&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 31.4144, &#39;x-ms-total-server-time-ms&#39;: 31.4144}\n\n\n\n&gt; g.V(&#39;800041335&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800053032&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;32584649-e624-4ea0-be52-38f4d481f8f3&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800053032&#39;, &#39;outV&#39;: &#39;800041335&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;7146f270-b13f-436b-bd99-3b20b6e0d992&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.3737, &#39;x-ms-total-server-time-ms&#39;: 13.3737}\n\n\n\n&gt; g.V(&#39;800041323&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800034583&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;b3228c0f-3d38-4d04-ac37-85f8be084eda&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800034583&#39;, &#39;outV&#39;: &#39;800041323&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;e7ddf571-5359-4bbc-ba73-6cf6a5e9b895&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.6347, &#39;x-ms-total-server-time-ms&#39;: 13.6347}\n\n\n\n&gt; g.V(&#39;800041336&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800041335&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;3ba187ec-5ac7-4807-842b-1c6f83401f76&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800041335&#39;, &#39;outV&#39;: &#39;800041336&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;f921f2c4-2652-49ac-86ce-99537a165b22&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 12.7773, &#39;x-ms-total-server-time-ms&#39;: 12.7773}\n\n\n\n&gt; g.V(&#39;800032620&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800041323&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;bc7e26b3-0ad2-41ee-a854-b7dd0408caaa&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800041323&#39;, &#39;outV&#39;: &#39;800032620&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;625358f8-d72e-4f2a-9e3c-efe4744fbb6e&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 41.5231, &#39;x-ms-total-server-time-ms&#39;: 41.5231}\n\n\n\n&gt; g.V(&#39;800033479&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800041336&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;35719bb3-4954-47d7-9d6b-e7f6e63a9183&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800041336&#39;, &#39;outV&#39;: &#39;800033479&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;ef76487c-854e-4e47-b47e-c5558cdee088&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.4388, &#39;x-ms-total-server-time-ms&#39;: 13.4388}\n\n\n\n&gt; g.V(&#39;800057750&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800032620&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;38c37525-13ee-4576-ac64-ac692cd61e8f&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800032620&#39;, &#39;outV&#39;: &#39;800057750&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;ee72d95c-5fb2-42ae-ae0d-d2fde51136e2&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 14.8713, &#39;x-ms-total-server-time-ms&#39;: 14.8713}\n\n\n\n&gt; g.V(&#39;800054157&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800033479&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;30be59fc-f59c-4f1e-88e7-906fcf558e84&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800033479&#39;, &#39;outV&#39;: &#39;800054157&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;9d44dcdf-372d-4063-a117-a828b7d94881&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 14.1714, &#39;x-ms-total-server-time-ms&#39;: 14.1714}\n\n\n\n&gt; g.V(&#39;800041447&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800032435&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;880a558d-3044-49ae-9cd8-55bba6bd2d5e&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800032435&#39;, &#39;outV&#39;: &#39;800041447&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;965197be-1ae9-4300-89db-6d1b7cec31d2&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 28.7001, &#39;x-ms-total-server-time-ms&#39;: 28.7001}\n\n\n\n&gt; g.V(&#39;800053769&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800041447&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;c04b7f26-7c20-4650-bbec-9d42311e9fcf&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800041447&#39;, &#39;outV&#39;: &#39;800053769&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;2a838b58-88ae-4df3-8ade-8221f0eb2dc6&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 12.9355, &#39;x-ms-total-server-time-ms&#39;: 12.9355}\n\n\n\n&gt; g.V(&#39;800048046&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800053769&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;59e52a28-9d7c-4c1a-b182-7b1bc2e0f54a&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800053769&#39;, &#39;outV&#39;: &#39;800048046&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;098bfc03-2277-4446-b426-62ae54f3c75d&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.0106, &#39;x-ms-total-server-time-ms&#39;: 13.0106}\n\n\n\n&gt; g.V(&#39;800042500&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800048046&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;984529d5-a5fd-4423-8755-e2e172ee4b50&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800048046&#39;, &#39;outV&#39;: &#39;800042500&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;8717a9f7-5da3-45be-92a8-ec06c5e7aafd&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.0807, &#39;x-ms-total-server-time-ms&#39;: 13.0807}\n\n\n\n&gt; g.V(&#39;800014680&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800042500&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;eb6bb3c5-b7c9-42ff-839b-b21567fe83da&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800042500&#39;, &#39;outV&#39;: &#39;800014680&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;bb2390e0-2fc0-4195-b773-40827223bfb2&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.1797, &#39;x-ms-total-server-time-ms&#39;: 13.1797}\n\n\n\n&gt; g.V(&#39;800059308&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800048046&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;1b6f4197-83bf-40fd-a4a3-3fc797148a82&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800048046&#39;, &#39;outV&#39;: &#39;800059308&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;af3d593a-8ed0-44ee-bbd5-808b518135ea&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.0728, &#39;x-ms-total-server-time-ms&#39;: 13.0728}\n\n\n\n&gt; g.V(&#39;800054608&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800042500&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;59c3ccf5-1001-42a5-a6f8-2369fb9d8584&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800042500&#39;, &#39;outV&#39;: &#39;800054608&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;b004ce89-c285-4b49-8bed-251cc1d7ec39&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.2527, &#39;x-ms-total-server-time-ms&#39;: 13.2527}\n\n\n\n&gt; g.V(&#39;800057297&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800053769&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;f6f91b4a-da1c-46a3-8a0b-cd432b1c1537&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800053769&#39;, &#39;outV&#39;: &#39;800057297&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;6c1d0e9f-d6b8-483f-88d4-4b8752779702&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.8625, &#39;x-ms-total-server-time-ms&#39;: 13.8625}\n\n\n\n&gt; g.V(&#39;800035989&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800048046&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;1e2814d6-2f45-46ca-be72-52636e80d759&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800048046&#39;, &#39;outV&#39;: &#39;800035989&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;27f0f31d-3202-4436-bd1d-3cc6df7ca8f2&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.0097, &#39;x-ms-total-server-time-ms&#39;: 13.0097}\n\n\n\n&gt; g.V(&#39;800036078&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800042500&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;7f72a616-96dd-4426-b196-59f0f09bbbc2&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800042500&#39;, &#39;outV&#39;: &#39;800036078&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;cf684202-abc3-4523-89a8-900e9cded661&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 13.359, &#39;x-ms-total-server-time-ms&#39;: 13.359}\n\n\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# Adding one new vertice and edge\nfrom gremlin_python.driver import client, serializer, protocol\nfrom gremlin_python.driver.protocol import GremlinServerError\nimport sys\nimport traceback\nimport asyncio\n\nif sys.platform == 'win32':\n    asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n    \n_gremlin_insert_new_vertice = [\"g.addV('position').property('id', '800035990').property('firstName', 'THOMAS').property('positionTitle', 'CIO').property('pk', 'pk')\"]\n\n_gremlin_insert_new_edge = [\"g.V('800035990').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800032435'))\"]\ndef insert_new_vertice(client):\n    for query in _gremlin_insert_new_vertice:\n        print(\"\\n> {0}\\n\".format(query))\n        callback = client.submitAsync(query)\n        if callback.result() is not None:\n            print(\"\\tInserted this vertex:\\n\\t{0}\".format(\n                callback.result().all().result()))\n        else:\n            print(\"Something went wrong with this query: {0}\".format(query))\n        print(\"\\n\")\n        print_status_attributes(callback.result())\n        print(\"\\n\")\n\n    print(\"\\n\")\n\n\ndef insert_new_edge(client):\n    for query in _gremlin_insert_new_edge:\n        print(\"\\n> {0}\\n\".format(query))\n        callback = client.submitAsync(query)\n        if callback.result() is not None:\n            print(\"\\tInserted this edge:\\n\\t{0}\\n\".format(\n                callback.result().all().result()))\n        else:\n            print(\"Something went wrong with this query:\\n\\t{0}\".format(query))\n        print_status_attributes(callback.result())\n        print(\"\\n\")\ntry:\n    client = client.Client('wss://positiongraph.gremlin.cosmos.azure.com:443/', 'g',\n                           username=\"/dbs/Position/colls/positions\",\n                           password=\"YHezU48GVZBBYP09VUKzOpsgI3AsMLWMzpfIM7glTOEcV7muhauFXS8oQC1ADIRxfP5YF0r75tOnrswT6UqNiQ==\",\n                           message_serializer=serializer.GraphSONSerializersV2d0()\n                           )\n    # Adding new vertice\n    insert_new_vertice(client)\n    \n    #Adding new edge\n    insert_new_edge(client)\n    \nexcept GremlinServerError as e:\n    print('Code: {0}, Attributes: {1}'.format(e.status_code, e.status_attributes))\n\n    cosmos_status_code = e.status_attributes[\"x-ms-status-code\"]\n    if cosmos_status_code == 409:\n        print('Conflict error!')\n    elif cosmos_status_code == 412:\n        print('Precondition error!')\n    elif cosmos_status_code == 429:\n        print('Throttling error!');\n    elif cosmos_status_code == 1009:\n        print('Request timeout error!')\n    else:\n        print(\"Default error handling\")\n\n    traceback.print_exc(file=sys.stdout) \n    sys.exit(1)\n"],"metadata":{"application/vnd.databricks.v1+cell":{"title":"","showTitle":false,"inputWidgets":{},"nuid":"8fe92f3d-afdd-4f3a-abf4-1a48819dfef8"}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800035990&#39;).property(&#39;firstName&#39;, &#39;THOMAS&#39;).property(&#39;positionTitle&#39;, &#39;CIO&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800035990&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;57965bbe-40e1-43d0-9438-c5076f0e55a6&#39;, &#39;value&#39;: &#39;THOMAS&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;a5eefade-a36b-47b7-a4cf-6c526058ae2c&#39;, &#39;value&#39;: &#39;CIO&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800035990|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;426cddab-67ec-438b-b7e8-8d1f2cd76f95&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 41.9242, &#39;x-ms-total-server-time-ms&#39;: 41.9242}\n\n\n\n\n\n&gt; g.V(&#39;800035990&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800032435&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;a9912507-5d5c-4517-985a-7e67afb1053d&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800032435&#39;, &#39;outV&#39;: &#39;800035990&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;760091b2-9f3d-448a-b408-eafc03466a96&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 73.2428, &#39;x-ms-total-server-time-ms&#39;: 73.2428}\n\n\n</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800035990&#39;).property(&#39;firstName&#39;, &#39;THOMAS&#39;).property(&#39;positionTitle&#39;, &#39;CIO&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800035990&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;57965bbe-40e1-43d0-9438-c5076f0e55a6&#39;, &#39;value&#39;: &#39;THOMAS&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;a5eefade-a36b-47b7-a4cf-6c526058ae2c&#39;, &#39;value&#39;: &#39;CIO&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800035990|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;426cddab-67ec-438b-b7e8-8d1f2cd76f95&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 41.9242, &#39;x-ms-total-server-time-ms&#39;: 41.9242}\n\n\n\n\n\n&gt; g.V(&#39;800035990&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800032435&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;a9912507-5d5c-4517-985a-7e67afb1053d&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800032435&#39;, &#39;outV&#39;: &#39;800035990&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;760091b2-9f3d-448a-b408-eafc03466a96&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 73.2428, &#39;x-ms-total-server-time-ms&#39;: 73.2428}\n\n\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# Drop a few vertice and edge\nfrom gremlin_python.driver import client, serializer, protocol\nfrom gremlin_python.driver.protocol import GremlinServerError\nimport sys\nimport traceback\nimport asyncio\n\nif sys.platform == 'win32':\n    asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n    \n_gremlin_drop_operations = {\n    \"Drop Edge\": \"g.V('800035990').outE('REPORTS_TO_CURRENT_POSITION').where(inV().has('id', '800035990')).drop()\",\n    \"Drop Vertex\": \"g.V('800035990').drop()\"\n}\ndef execute_drop_operations(client):\n    for key in _gremlin_drop_operations:\n        print(\"{0}:\".format(key))\n        print(\"\\n> {0}\".format(\n            _gremlin_drop_operations[key]))\n        callback = client.submitAsync(_gremlin_drop_operations[key])\n        for result in callback.result():\n            print(result)\n        print_status_attributes(callback.result())\n        print(\"\\n\")\ntry:\n    client = client.Client('wss://positiongraph.gremlin.cosmos.azure.com:443/', 'g',\n                           username=\"/dbs/Position/colls/positions\",\n                           password=\"YHezU48GVZBBYP09VUKzOpsgI3AsMLWMzpfIM7glTOEcV7muhauFXS8oQC1ADIRxfP5YF0r75tOnrswT6UqNiQ==\",\n                           message_serializer=serializer.GraphSONSerializersV2d0()\n                           )\n    # Drop a few vertices and edges\n    execute_drop_operations(client)\nexcept GremlinServerError as e:\n    print('Code: {0}, Attributes: {1}'.format(e.status_code, e.status_attributes))\n\n    cosmos_status_code = e.status_attributes[\"x-ms-status-code\"]\n    if cosmos_status_code == 409:\n        print('Conflict error!')\n    elif cosmos_status_code == 412:\n        print('Precondition error!')\n    elif cosmos_status_code == 429:\n        print('Throttling error!');\n    elif cosmos_status_code == 1009:\n        print('Request timeout error!')\n    else:\n        print(\"Default error handling\")\n\n    traceback.print_exc(file=sys.stdout) \n    sys.exit(1)\n"],"metadata":{"application/vnd.databricks.v1+cell":{"title":"","showTitle":false,"inputWidgets":{},"nuid":"6e46a800-0af3-4aec-b776-584abf7ec185"}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Drop Edge:\n\n&gt; g.V(&#39;800035990&#39;).outE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).where(inV().has(&#39;id&#39;, &#39;800035990&#39;)).drop()\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;b952a3c9-a041-4fb0-add1-6748c7b5b41e&#39;, &#39;x-ms-request-charge&#39;: 9.46, &#39;x-ms-total-request-charge&#39;: 9.46, &#39;x-ms-server-time-ms&#39;: 68.5462, &#39;x-ms-total-server-time-ms&#39;: 68.5462}\n\n\nDrop Vertex:\n\n&gt; g.V(&#39;800035990&#39;).drop()\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;209c1b02-8e68-453c-9c75-c01e6089d7c7&#39;, &#39;x-ms-request-charge&#39;: 26.840000000000003, &#39;x-ms-total-request-charge&#39;: 26.840000000000003, &#39;x-ms-server-time-ms&#39;: 81.9375, &#39;x-ms-total-server-time-ms&#39;: 81.9375}\n\n\n</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Drop Edge:\n\n&gt; g.V(&#39;800035990&#39;).outE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).where(inV().has(&#39;id&#39;, &#39;800035990&#39;)).drop()\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;b952a3c9-a041-4fb0-add1-6748c7b5b41e&#39;, &#39;x-ms-request-charge&#39;: 9.46, &#39;x-ms-total-request-charge&#39;: 9.46, &#39;x-ms-server-time-ms&#39;: 68.5462, &#39;x-ms-total-server-time-ms&#39;: 68.5462}\n\n\nDrop Vertex:\n\n&gt; g.V(&#39;800035990&#39;).drop()\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;209c1b02-8e68-453c-9c75-c01e6089d7c7&#39;, &#39;x-ms-request-charge&#39;: 26.840000000000003, &#39;x-ms-total-request-charge&#39;: 26.840000000000003, &#39;x-ms-server-time-ms&#39;: 81.9375, &#39;x-ms-total-server-time-ms&#39;: 81.9375}\n\n\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# Adding two new vertices and edges\nfrom gremlin_python.driver import client, serializer, protocol\nfrom gremlin_python.driver.protocol import GremlinServerError\nimport sys\nimport traceback\nimport asyncio\n\nif sys.platform == 'win32':\n    asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n    \n_gremlin_insert_new_vertices = [\n    \"g.addV('position').property('id', '800035191').property('firstName', 'LUC').property('positionTitle', 'Developer').property('pk', 'pk')\",\n    \"g.addV('position').property('id', '800035192').property('firstName', 'RENE').property('positionTitle', 'Developer').property('pk', 'pk')\"\n]\n\n_gremlin_insert_new_edges = [\"g.V('800035191').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800036078'))\",\"g.V('800035192').addE('REPORTS_TO_CURRENT_POSITION').to(g.V('800035191'))\"]\n\ndef insert_new_vertices(client):\n    for query in _gremlin_insert_new_vertices:\n        print(\"\\n> {0}\\n\".format(query))\n        callback = client.submitAsync(query)\n        if callback.result() is not None:\n            print(\"\\tInserted this vertex:\\n\\t{0}\".format(\n                callback.result().all().result()))\n        else:\n            print(\"Something went wrong with this query: {0}\".format(query))\n        print(\"\\n\")\n        print_status_attributes(callback.result())\n        print(\"\\n\")\n\n    print(\"\\n\")\n\n\ndef insert_new_edges(client):\n    for query in _gremlin_insert_new_edges:\n        print(\"\\n> {0}\\n\".format(query))\n        callback = client.submitAsync(query)\n        if callback.result() is not None:\n            print(\"\\tInserted this edge:\\n\\t{0}\\n\".format(\n                callback.result().all().result()))\n        else:\n            print(\"Something went wrong with this query:\\n\\t{0}\".format(query))\n        print_status_attributes(callback.result())\n        print(\"\\n\")\ntry:\n    client = client.Client('wss://positiongraph.gremlin.cosmos.azure.com:443/', 'g',\n                           username=\"/dbs/Position/colls/positions\",\n                           password=\"YHezU48GVZBBYP09VUKzOpsgI3AsMLWMzpfIM7glTOEcV7muhauFXS8oQC1ADIRxfP5YF0r75tOnrswT6UqNiQ==\",\n                           message_serializer=serializer.GraphSONSerializersV2d0()\n                           )\n    # Adding new vertice\n    insert_new_vertices(client)\n    \n    #Adding new edge\n    insert_new_edges(client)\n    \nexcept GremlinServerError as e:\n    print('Code: {0}, Attributes: {1}'.format(e.status_code, e.status_attributes))\n\n    cosmos_status_code = e.status_attributes[\"x-ms-status-code\"]\n    if cosmos_status_code == 409:\n        print('Conflict error!')\n    elif cosmos_status_code == 412:\n        print('Precondition error!')\n    elif cosmos_status_code == 429:\n        print('Throttling error!');\n    elif cosmos_status_code == 1009:\n        print('Request timeout error!')\n    else:\n        print(\"Default error handling\")\n\n    traceback.print_exc(file=sys.stdout) \n    sys.exit(1)\n"],"metadata":{"application/vnd.databricks.v1+cell":{"title":"","showTitle":false,"inputWidgets":{},"nuid":"86fcfd25-3687-4ecf-b382-d67510416ed3"}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800035191&#39;).property(&#39;firstName&#39;, &#39;LUC&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800035191&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;90f91941-ab6f-41d0-a64c-07dbc253d17b&#39;, &#39;value&#39;: &#39;LUC&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;116ae030-e73b-4339-9c6d-2cfc61700ba8&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800035191|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;58b75414-9c51-4812-a442-0201e329af1f&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 9.4426, &#39;x-ms-total-server-time-ms&#39;: 9.4426}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800035192&#39;).property(&#39;firstName&#39;, &#39;RENE&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800035192&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;c0867453-35db-4e21-9e07-827507de6e2b&#39;, &#39;value&#39;: &#39;RENE&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;cc5afb1f-11f5-4818-9753-d9a026c4f1f2&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800035192|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;4d0d76de-6b60-473a-b0e7-31df46c95959&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.3673, &#39;x-ms-total-server-time-ms&#39;: 6.3673}\n\n\n\n\n\n&gt; g.V(&#39;800035191&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800036078&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;0fea63e8-6394-4281-b8b1-d110f77822fc&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800036078&#39;, &#39;outV&#39;: &#39;800035191&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;93798f0a-f4ba-48fc-90fc-39909f526667&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 60.6333, &#39;x-ms-total-server-time-ms&#39;: 60.6333}\n\n\n\n&gt; g.V(&#39;800035192&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800035191&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;52d87002-8cbe-473d-90db-cacb200911be&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800035191&#39;, &#39;outV&#39;: &#39;800035192&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;f644172a-b61e-4cf5-85d6-f88c14dc139b&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 61.8598, &#39;x-ms-total-server-time-ms&#39;: 61.8598}\n\n\n</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800035191&#39;).property(&#39;firstName&#39;, &#39;LUC&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800035191&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;90f91941-ab6f-41d0-a64c-07dbc253d17b&#39;, &#39;value&#39;: &#39;LUC&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;116ae030-e73b-4339-9c6d-2cfc61700ba8&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800035191|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;58b75414-9c51-4812-a442-0201e329af1f&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 9.4426, &#39;x-ms-total-server-time-ms&#39;: 9.4426}\n\n\n\n&gt; g.addV(&#39;position&#39;).property(&#39;id&#39;, &#39;800035192&#39;).property(&#39;firstName&#39;, &#39;RENE&#39;).property(&#39;positionTitle&#39;, &#39;Developer&#39;).property(&#39;pk&#39;, &#39;pk&#39;)\n\n\tInserted this vertex:\n\t[{&#39;id&#39;: &#39;800035192&#39;, &#39;label&#39;: &#39;position&#39;, &#39;type&#39;: &#39;vertex&#39;, &#39;properties&#39;: {&#39;firstName&#39;: [{&#39;id&#39;: &#39;c0867453-35db-4e21-9e07-827507de6e2b&#39;, &#39;value&#39;: &#39;RENE&#39;}], &#39;positionTitle&#39;: [{&#39;id&#39;: &#39;cc5afb1f-11f5-4818-9753-d9a026c4f1f2&#39;, &#39;value&#39;: &#39;Developer&#39;}], &#39;pk&#39;: [{&#39;id&#39;: &#39;800035192|pk&#39;, &#39;value&#39;: &#39;pk&#39;}]}}]\n\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;4d0d76de-6b60-473a-b0e7-31df46c95959&#39;, &#39;x-ms-request-charge&#39;: 9.33, &#39;x-ms-total-request-charge&#39;: 9.33, &#39;x-ms-server-time-ms&#39;: 6.3673, &#39;x-ms-total-server-time-ms&#39;: 6.3673}\n\n\n\n\n\n&gt; g.V(&#39;800035191&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800036078&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;0fea63e8-6394-4281-b8b1-d110f77822fc&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800036078&#39;, &#39;outV&#39;: &#39;800035191&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;93798f0a-f4ba-48fc-90fc-39909f526667&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 60.6333, &#39;x-ms-total-server-time-ms&#39;: 60.6333}\n\n\n\n&gt; g.V(&#39;800035192&#39;).addE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).to(g.V(&#39;800035191&#39;))\n\n\tInserted this edge:\n\t[{&#39;id&#39;: &#39;52d87002-8cbe-473d-90db-cacb200911be&#39;, &#39;label&#39;: &#39;REPORTS_TO_CURRENT_POSITION&#39;, &#39;type&#39;: &#39;edge&#39;, &#39;inVLabel&#39;: &#39;position&#39;, &#39;outVLabel&#39;: &#39;position&#39;, &#39;inV&#39;: &#39;800035191&#39;, &#39;outV&#39;: &#39;800035192&#39;}]\n\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;f644172a-b61e-4cf5-85d6-f88c14dc139b&#39;, &#39;x-ms-request-charge&#39;: 14.420000000000002, &#39;x-ms-total-request-charge&#39;: 14.420000000000002, &#39;x-ms-server-time-ms&#39;: 61.8598, &#39;x-ms-total-server-time-ms&#39;: 61.8598}\n\n\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# Drop a few vertices and edges\nfrom gremlin_python.driver import client, serializer, protocol\nfrom gremlin_python.driver.protocol import GremlinServerError\nimport sys\nimport traceback\nimport asyncio\n\nif sys.platform == 'win32':\n    asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n    \n_gremlin_drops_operations = {\n    \"Drop Edge\": \"g.V('800035191').outE('REPORTS_TO_CURRENT_POSITION').where(inV().has('id', '800035191')).drop()\",\n    \"Drop Vertex\": \"g.V('800035191').drop()\"\n   \n}\ndef execute_drops_operations(client):\n    for key in _gremlin_drops_operations:\n        print(\"{0}:\".format(key))\n        print(\"\\n> {0}\".format(\n            _gremlin_drops_operations[key]))\n        callback = client.submitAsync(_gremlin_drops_operations[key])\n        for result in callback.result():\n            print(result)\n        print_status_attributes(callback.result())\n        print(\"\\n\")\ntry:\n    client = client.Client('wss://positiongraph.gremlin.cosmos.azure.com:443/', 'g',\n                           username=\"/dbs/Position/colls/positions\",\n                           password=\"YHezU48GVZBBYP09VUKzOpsgI3AsMLWMzpfIM7glTOEcV7muhauFXS8oQC1ADIRxfP5YF0r75tOnrswT6UqNiQ==\",\n                           message_serializer=serializer.GraphSONSerializersV2d0()\n                           )\n    # Drop a few vertices and edges\n    execute_drops_operations(client)\nexcept GremlinServerError as e:\n    print('Code: {0}, Attributes: {1}'.format(e.status_code, e.status_attributes))\n\n    cosmos_status_code = e.status_attributes[\"x-ms-status-code\"]\n    if cosmos_status_code == 409:\n        print('Conflict error!')\n    elif cosmos_status_code == 412:\n        print('Precondition error!')\n    elif cosmos_status_code == 429:\n        print('Throttling error!');\n    elif cosmos_status_code == 1009:\n        print('Request timeout error!')\n    else:\n        print(\"Default error handling\")\n\n    traceback.print_exc(file=sys.stdout) \n    sys.exit(1)\n"],"metadata":{"application/vnd.databricks.v1+cell":{"title":"","showTitle":false,"inputWidgets":{},"nuid":"c112a91c-7a1c-4390-937a-b7bbbd1a34e6"}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Drop Edge:\n\n&gt; g.V(&#39;800035191&#39;).outE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).where(inV().has(&#39;id&#39;, &#39;800035191&#39;)).drop()\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;80c470a6-53ce-4cfc-8dc7-7fd22a67fc07&#39;, &#39;x-ms-request-charge&#39;: 9.46, &#39;x-ms-total-request-charge&#39;: 9.46, &#39;x-ms-server-time-ms&#39;: 113.4784, &#39;x-ms-total-server-time-ms&#39;: 113.4784}\n\n\nDrop Vertex:\n\n&gt; g.V(&#39;800035191&#39;).drop()\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;59b0983d-53e5-48ee-b7d6-84f2fcd3b322&#39;, &#39;x-ms-request-charge&#39;: 35.35, &#39;x-ms-total-request-charge&#39;: 35.35, &#39;x-ms-server-time-ms&#39;: 86.0873, &#39;x-ms-total-server-time-ms&#39;: 86.0873}\n\n\n</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Drop Edge:\n\n&gt; g.V(&#39;800035191&#39;).outE(&#39;REPORTS_TO_CURRENT_POSITION&#39;).where(inV().has(&#39;id&#39;, &#39;800035191&#39;)).drop()\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;80c470a6-53ce-4cfc-8dc7-7fd22a67fc07&#39;, &#39;x-ms-request-charge&#39;: 9.46, &#39;x-ms-total-request-charge&#39;: 9.46, &#39;x-ms-server-time-ms&#39;: 113.4784, &#39;x-ms-total-server-time-ms&#39;: 113.4784}\n\n\nDrop Vertex:\n\n&gt; g.V(&#39;800035191&#39;).drop()\n\tResponse status_attributes:\n\t{&#39;x-ms-status-code&#39;: 200, &#39;x-ms-activity-id&#39;: &#39;59b0983d-53e5-48ee-b7d6-84f2fcd3b322&#39;, &#39;x-ms-request-charge&#39;: 35.35, &#39;x-ms-total-request-charge&#39;: 35.35, &#39;x-ms-server-time-ms&#39;: 86.0873, &#39;x-ms-total-server-time-ms&#39;: 86.0873}\n\n\n</div>"]}}],"execution_count":0}],"metadata":{"application/vnd.databricks.v1+notebook":{"notebookName":"Gremlin_StaticDataLoad","dashboards":[],"notebookMetadata":{"pythonIndentUnit":4},"language":"python","widgets":{},"notebookOrigID":2570845455186643}},"nbformat":4,"nbformat_minor":0}
